busy-app/busybar-firmware/lib/simplicity_sdk_new/devices/platform/Device/SiliconLabs/EFR32FG2D/Include/efr32fg2d_emu.h
/* Bit fields for EMU CTRL */
#define _EMU_CTRL_RESETVALUE                               0x08000200UL                                            /**< Default value for EMU_CTRL                  */
#define _EMU_CTRL_MASK                                     0xFE010309UL                                            /**< Mask for EMU_CTRL                           */
#define EMU_CTRL_EM2DBGEN                                  (0x1UL << 0)                                            /**< Enable debugging in EM2                     */
#define _EMU_CTRL_EM2DBGEN_SHIFT                           0                                                       /**< Shift value for EMU_EM2DBGEN                */
#define _EMU_CTRL_EM2DBGEN_MASK                            0x1UL                                                   /**< Bit mask for EMU_EM2DBGEN                   */
#define _EMU_CTRL_EM2DBGEN_DEFAULT                         0x00000000UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define EMU_CTRL_EM2DBGEN_DEFAULT                          (_EMU_CTRL_EM2DBGEN_DEFAULT << 0)                       /**< Shifted mode DEFAULT for EMU_CTRL           */
#define EMU_CTRL_TEMPAVGNUM                                (0x1UL << 3)                                            /**< Averaged Temperature samples num            */
#define _EMU_CTRL_TEMPAVGNUM_SHIFT                         3                                                       /**< Shift value for EMU_TEMPAVGNUM              */
#define _EMU_CTRL_TEMPAVGNUM_MASK                          0x8UL                                                   /**< Bit mask for EMU_TEMPAVGNUM                 */
#define _EMU_CTRL_TEMPAVGNUM_DEFAULT                       0x00000000UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define _EMU_CTRL_TEMPAVGNUM_N16                           0x00000000UL                                            /**< Mode N16 for EMU_CTRL                       */
#define _EMU_CTRL_TEMPAVGNUM_N64                           0x00000001UL                                            /**< Mode N64 for EMU_CTRL                       */
#define EMU_CTRL_TEMPAVGNUM_DEFAULT                        (_EMU_CTRL_TEMPAVGNUM_DEFAULT << 3)                     /**< Shifted mode DEFAULT for EMU_CTRL           */
#define EMU_CTRL_TEMPAVGNUM_N16                            (_EMU_CTRL_TEMPAVGNUM_N16 << 3)                         /**< Shifted mode N16 for EMU_CTRL               */
#define EMU_CTRL_TEMPAVGNUM_N64                            (_EMU_CTRL_TEMPAVGNUM_N64 << 3)                         /**< Shifted mode N64 for EMU_CTRL               */
#define _EMU_CTRL_EM23VSCALE_SHIFT                         8                                                       /**< Shift value for EMU_EM23VSCALE              */
#define _EMU_CTRL_EM23VSCALE_MASK                          0x300UL                                                 /**< Bit mask for EMU_EM23VSCALE                 */
#define _EMU_CTRL_EM23VSCALE_DEFAULT                       0x00000002UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define _EMU_CTRL_EM23VSCALE_VSCALE0                       0x00000000UL                                            /**< Mode VSCALE0 for EMU_CTRL                   */
#define _EMU_CTRL_EM23VSCALE_VSCALE1                       0x00000001UL                                            /**< Mode VSCALE1 for EMU_CTRL                   */
#define _EMU_CTRL_EM23VSCALE_VSCALE2                       0x00000002UL                                            /**< Mode VSCALE2 for EMU_CTRL                   */
#define EMU_CTRL_EM23VSCALE_DEFAULT                        (_EMU_CTRL_EM23VSCALE_DEFAULT << 8)                     /**< Shifted mode DEFAULT for EMU_CTRL           */
#define EMU_CTRL_EM23VSCALE_VSCALE0                        (_EMU_CTRL_EM23VSCALE_VSCALE0 << 8)                     /**< Shifted mode VSCALE0 for EMU_CTRL           */
#define EMU_CTRL_EM23VSCALE_VSCALE1                        (_EMU_CTRL_EM23VSCALE_VSCALE1 << 8)                     /**< Shifted mode VSCALE1 for EMU_CTRL           */
#define EMU_CTRL_EM23VSCALE_VSCALE2                        (_EMU_CTRL_EM23VSCALE_VSCALE2 << 8)                     /**< Shifted mode VSCALE2 for EMU_CTRL           */
#define EMU_CTRL_FLASHPWRUPONDEMAND                        (0x1UL << 16)                                           /**< Enable flash on demand wakeup               */
#define _EMU_CTRL_FLASHPWRUPONDEMAND_SHIFT                 16                                                      /**< Shift value for EMU_FLASHPWRUPONDEMAND      */
#define _EMU_CTRL_FLASHPWRUPONDEMAND_MASK                  0x10000UL                                               /**< Bit mask for EMU_FLASHPWRUPONDEMAND         */
#define _EMU_CTRL_FLASHPWRUPONDEMAND_DEFAULT               0x00000000UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define EMU_CTRL_FLASHPWRUPONDEMAND_DEFAULT                (_EMU_CTRL_FLASHPWRUPONDEMAND_DEFAULT << 16)            /**< Shifted mode DEFAULT for EMU_CTRL           */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_SHIFT                 25                                                      /**< Shift value for EMU_DOMODEREGOFFDLYSEL      */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_MASK                  0x1E000000UL                                            /**< Bit mask for EMU_DOMODEREGOFFDLYSEL         */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_DEFAULT               0x00000004UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff0us             0x00000000UL                                            /**< Mode regoff0us for EMU_CTRL                 */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff2p5us           0x00000001UL                                            /**< Mode regoff2p5us for EMU_CTRL               */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff5us             0x00000002UL                                            /**< Mode regoff5us for EMU_CTRL                 */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff7p5us           0x00000003UL                                            /**< Mode regoff7p5us for EMU_CTRL               */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff10us_default    0x00000004UL                                            /**< Mode regoff10us_default for EMU_CTRL        */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff12p5us          0x00000005UL                                            /**< Mode regoff12p5us for EMU_CTRL              */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff15us            0x00000006UL                                            /**< Mode regoff15us for EMU_CTRL                */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff17p5us          0x00000007UL                                            /**< Mode regoff17p5us for EMU_CTRL              */
#define _EMU_CTRL_DOMODEREGOFFDLYSEL_regoff20us            0x00000008UL                                            /**< Mode regoff20us for EMU_CTRL                */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_DEFAULT                (_EMU_CTRL_DOMODEREGOFFDLYSEL_DEFAULT << 25)            /**< Shifted mode DEFAULT for EMU_CTRL           */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff0us              (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff0us << 25)          /**< Shifted mode regoff0us for EMU_CTRL         */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff2p5us            (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff2p5us << 25)        /**< Shifted mode regoff2p5us for EMU_CTRL       */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff5us              (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff5us << 25)          /**< Shifted mode regoff5us for EMU_CTRL         */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff7p5us            (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff7p5us << 25)        /**< Shifted mode regoff7p5us for EMU_CTRL       */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff10us_default     (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff10us_default << 25) /**< Shifted mode regoff10us_default for EMU_CTRL*/
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff12p5us           (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff12p5us << 25)       /**< Shifted mode regoff12p5us for EMU_CTRL      */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff15us             (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff15us << 25)         /**< Shifted mode regoff15us for EMU_CTRL        */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff17p5us           (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff17p5us << 25)       /**< Shifted mode regoff17p5us for EMU_CTRL      */
#define EMU_CTRL_DOMODEREGOFFDLYSEL_regoff20us             (_EMU_CTRL_DOMODEREGOFFDLYSEL_regoff20us << 25)         /**< Shifted mode regoff20us for EMU_CTRL        */
#define EMU_CTRL_EFPDIRECTMODEEN                           (0x1UL << 29)                                           /**< EFP Direct Mode Enable                      */
#define _EMU_CTRL_EFPDIRECTMODEEN_SHIFT                    29                                                      /**< Shift value for EMU_EFPDIRECTMODEEN         */
#define _EMU_CTRL_EFPDIRECTMODEEN_MASK                     0x20000000UL                                            /**< Bit mask for EMU_EFPDIRECTMODEEN            */
#define _EMU_CTRL_EFPDIRECTMODEEN_DEFAULT                  0x00000000UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define EMU_CTRL_EFPDIRECTMODEEN_DEFAULT                   (_EMU_CTRL_EFPDIRECTMODEEN_DEFAULT << 29)               /**< Shifted mode DEFAULT for EMU_CTRL           */
#define EMU_CTRL_EFPDRVDECOUPLE                            (0x1UL << 30)                                           /**< EFP drives DECOUPLE                         */
#define _EMU_CTRL_EFPDRVDECOUPLE_SHIFT                     30                                                      /**< Shift value for EMU_EFPDRVDECOUPLE          */
#define _EMU_CTRL_EFPDRVDECOUPLE_MASK                      0x40000000UL                                            /**< Bit mask for EMU_EFPDRVDECOUPLE             */
#define _EMU_CTRL_EFPDRVDECOUPLE_DEFAULT                   0x00000000UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define EMU_CTRL_EFPDRVDECOUPLE_DEFAULT                    (_EMU_CTRL_EFPDRVDECOUPLE_DEFAULT << 30)                /**< Shifted mode DEFAULT for EMU_CTRL           */
#define EMU_CTRL_EFPDRVDVDD                                (0x1UL << 31)                                           /**< EFP drives DVDD                             */
#define _EMU_CTRL_EFPDRVDVDD_SHIFT                         31                                                      /**< Shift value for EMU_EFPDRVDVDD              */
#define _EMU_CTRL_EFPDRVDVDD_MASK                          0x80000000UL                                            /**< Bit mask for EMU_EFPDRVDVDD                 */
#define _EMU_CTRL_EFPDRVDVDD_DEFAULT                       0x00000000UL                                            /**< Mode DEFAULT for EMU_CTRL                   */
#define EMU_CTRL_EFPDRVDVDD_DEFAULT                        (_EMU_CTRL_EFPDRVDVDD_DEFAULT << 31)                    /**< Shifted mode DEFAULT for EMU_CTRL           */

/* Bit fields for EMU TEMPLIMITS */
#define _EMU_TEMPLIMITS_RESETVALUE                         0x01FF0000UL                             /**< Default value for EMU_TEMPLIMITS            */
#define _EMU_TEMPLIMITS_MASK                               0x01FF01FFUL                             /**< Mask for EMU_TEMPLIMITS                     */
#define _EMU_TEMPLIMITS_TEMPLOW_SHIFT                      0                                        /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_TEMPLIMITS_TEMPLOW_MASK                       0x1FFUL                                  /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_TEMPLIMITS_TEMPLOW_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for EMU_TEMPLIMITS             */
#define EMU_TEMPLIMITS_TEMPLOW_DEFAULT                     (_EMU_TEMPLIMITS_TEMPLOW_DEFAULT << 0)   /**< Shifted mode DEFAULT for EMU_TEMPLIMITS     */
#define _EMU_TEMPLIMITS_TEMPHIGH_SHIFT                     16                                       /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_TEMPLIMITS_TEMPHIGH_MASK                      0x1FF0000UL                              /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_TEMPLIMITS_TEMPHIGH_DEFAULT                   0x000001FFUL                             /**< Mode DEFAULT for EMU_TEMPLIMITS             */
#define EMU_TEMPLIMITS_TEMPHIGH_DEFAULT                    (_EMU_TEMPLIMITS_TEMPHIGH_DEFAULT << 16) /**< Shifted mode DEFAULT for EMU_TEMPLIMITS     */

/* Bit fields for EMU STATUS */
#define _EMU_STATUS_RESETVALUE                             0x00000080UL                             /**< Default value for EMU_STATUS                */
#define _EMU_STATUS_MASK                                   0xFFFFD7FFUL                             /**< Mask for EMU_STATUS                         */
#define EMU_STATUS_LOCK                                    (0x1UL << 0)                             /**< Lock status                                 */
#define _EMU_STATUS_LOCK_SHIFT                             0                                        /**< Shift value for EMU_LOCK                    */
#define _EMU_STATUS_LOCK_MASK                              0x1UL                                    /**< Bit mask for EMU_LOCK                       */
#define _EMU_STATUS_LOCK_DEFAULT                           0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define _EMU_STATUS_LOCK_UNLOCKED                          0x00000000UL                             /**< Mode UNLOCKED for EMU_STATUS                */
#define _EMU_STATUS_LOCK_LOCKED                            0x00000001UL                             /**< Mode LOCKED for EMU_STATUS                  */
#define EMU_STATUS_LOCK_DEFAULT                            (_EMU_STATUS_LOCK_DEFAULT << 0)          /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_LOCK_UNLOCKED                           (_EMU_STATUS_LOCK_UNLOCKED << 0)         /**< Shifted mode UNLOCKED for EMU_STATUS        */
#define EMU_STATUS_LOCK_LOCKED                             (_EMU_STATUS_LOCK_LOCKED << 0)           /**< Shifted mode LOCKED for EMU_STATUS          */
#define EMU_STATUS_FIRSTTEMPDONE                           (0x1UL << 1)                             /**< First Temp done                             */
#define _EMU_STATUS_FIRSTTEMPDONE_SHIFT                    1                                        /**< Shift value for EMU_FIRSTTEMPDONE           */
#define _EMU_STATUS_FIRSTTEMPDONE_MASK                     0x2UL                                    /**< Bit mask for EMU_FIRSTTEMPDONE              */
#define _EMU_STATUS_FIRSTTEMPDONE_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_FIRSTTEMPDONE_DEFAULT                   (_EMU_STATUS_FIRSTTEMPDONE_DEFAULT << 1) /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_TEMPACTIVE                              (0x1UL << 2)                             /**< Temp active                                 */
#define _EMU_STATUS_TEMPACTIVE_SHIFT                       2                                        /**< Shift value for EMU_TEMPACTIVE              */
#define _EMU_STATUS_TEMPACTIVE_MASK                        0x4UL                                    /**< Bit mask for EMU_TEMPACTIVE                 */
#define _EMU_STATUS_TEMPACTIVE_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_TEMPACTIVE_DEFAULT                      (_EMU_STATUS_TEMPACTIVE_DEFAULT << 2)    /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_TEMPAVGACTIVE                           (0x1UL << 3)                             /**< Temp Average active                         */
#define _EMU_STATUS_TEMPAVGACTIVE_SHIFT                    3                                        /**< Shift value for EMU_TEMPAVGACTIVE           */
#define _EMU_STATUS_TEMPAVGACTIVE_MASK                     0x8UL                                    /**< Bit mask for EMU_TEMPAVGACTIVE              */
#define _EMU_STATUS_TEMPAVGACTIVE_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_TEMPAVGACTIVE_DEFAULT                   (_EMU_STATUS_TEMPAVGACTIVE_DEFAULT << 3) /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_VSCALEBUSY                              (0x1UL << 4)                             /**< Vscale busy                                 */
#define _EMU_STATUS_VSCALEBUSY_SHIFT                       4                                        /**< Shift value for EMU_VSCALEBUSY              */
#define _EMU_STATUS_VSCALEBUSY_MASK                        0x10UL                                   /**< Bit mask for EMU_VSCALEBUSY                 */
#define _EMU_STATUS_VSCALEBUSY_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_VSCALEBUSY_DEFAULT                      (_EMU_STATUS_VSCALEBUSY_DEFAULT << 4)    /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_VSCALEFAILED                            (0x1UL << 5)                             /**< Vscale failed                               */
#define _EMU_STATUS_VSCALEFAILED_SHIFT                     5                                        /**< Shift value for EMU_VSCALEFAILED            */
#define _EMU_STATUS_VSCALEFAILED_MASK                      0x20UL                                   /**< Bit mask for EMU_VSCALEFAILED               */
#define _EMU_STATUS_VSCALEFAILED_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_VSCALEFAILED_DEFAULT                    (_EMU_STATUS_VSCALEFAILED_DEFAULT << 5)  /**< Shifted mode DEFAULT for EMU_STATUS         */
#define _EMU_STATUS_VSCALE_SHIFT                           6                                        /**< Shift value for EMU_VSCALE                  */
#define _EMU_STATUS_VSCALE_MASK                            0xC0UL                                   /**< Bit mask for EMU_VSCALE                     */
#define _EMU_STATUS_VSCALE_DEFAULT                         0x00000002UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define _EMU_STATUS_VSCALE_VSCALE0                         0x00000000UL                             /**< Mode VSCALE0 for EMU_STATUS                 */
#define _EMU_STATUS_VSCALE_VSCALE1                         0x00000001UL                             /**< Mode VSCALE1 for EMU_STATUS                 */
#define _EMU_STATUS_VSCALE_VSCALE2                         0x00000002UL                             /**< Mode VSCALE2 for EMU_STATUS                 */
#define EMU_STATUS_VSCALE_DEFAULT                          (_EMU_STATUS_VSCALE_DEFAULT << 6)        /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_VSCALE_VSCALE0                          (_EMU_STATUS_VSCALE_VSCALE0 << 6)        /**< Shifted mode VSCALE0 for EMU_STATUS         */
#define EMU_STATUS_VSCALE_VSCALE1                          (_EMU_STATUS_VSCALE_VSCALE1 << 6)        /**< Shifted mode VSCALE1 for EMU_STATUS         */
#define EMU_STATUS_VSCALE_VSCALE2                          (_EMU_STATUS_VSCALE_VSCALE2 << 6)        /**< Shifted mode VSCALE2 for EMU_STATUS         */
#define EMU_STATUS_RACACTIVE                               (0x1UL << 10)                            /**< RAC active                                  */
#define _EMU_STATUS_RACACTIVE_SHIFT                        10                                       /**< Shift value for EMU_RACACTIVE               */
#define _EMU_STATUS_RACACTIVE_MASK                         0x400UL                                  /**< Bit mask for EMU_RACACTIVE                  */
#define _EMU_STATUS_RACACTIVE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_RACACTIVE_DEFAULT                       (_EMU_STATUS_RACACTIVE_DEFAULT << 10)    /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_EM4IORET                                (0x1UL << 12)                            /**< EM4 IO retention status                     */
#define _EMU_STATUS_EM4IORET_SHIFT                         12                                       /**< Shift value for EMU_EM4IORET                */
#define _EMU_STATUS_EM4IORET_MASK                          0x1000UL                                 /**< Bit mask for EMU_EM4IORET                   */
#define _EMU_STATUS_EM4IORET_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_EM4IORET_DEFAULT                        (_EMU_STATUS_EM4IORET_DEFAULT << 12)     /**< Shifted mode DEFAULT for EMU_STATUS         */
#define EMU_STATUS_EM2ENTERED                              (0x1UL << 14)                            /**< EM2 entered                                 */
#define _EMU_STATUS_EM2ENTERED_SHIFT                       14                                       /**< Shift value for EMU_EM2ENTERED              */
#define _EMU_STATUS_EM2ENTERED_MASK                        0x4000UL                                 /**< Bit mask for EMU_EM2ENTERED                 */
#define _EMU_STATUS_EM2ENTERED_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for EMU_STATUS                 */
#define EMU_STATUS_EM2ENTERED_DEFAULT                      (_EMU_STATUS_EM2ENTERED_DEFAULT << 14)   /**< Shifted mode DEFAULT for EMU_STATUS         */

